{
  "experiences": [
    {
      "id": "jpmorgan",
      "company": "JPMorgan Chase",
      "position": "Software Engineer II",
      "description": "I led the development of a critical customer data API at JPMorgan Chase, building the service from the ground up to serve the entire bank. Taking the application from concept through production, it became one of the firm's most widely used and essential services, scaling to handle more than three times its initial traffic growth.",
      "url": "https://www.jpmorganchase.com",
      "dates": "2023 - 2024",
      "location": "NYC, NY",
      "skills": ["Java", "Spring Webflux", "CockroachDB", "Cassandra", "PostgreSQL", "Docker", "Kubernetes", "Helm"],
      "featured": true,
      "order": 1
    },
    {
      "id": "bnymellon-lead",
      "company": "BNY Mellon",
      "position": "Lead Software Engineer",
      "description": "Following the application's initial success, I was promoted to Lead Software Engineer and took full ownership of the project. I led the full-stack development, scaling the platform to serve over 50,000 users and saving the company more than $500,000. My responsibilities grew to include designing the security architecture and mentoring two junior developers, guiding the application to become a critical tool for the entire firm.",
      "url": "https://www.bnymellon.com",
      "dates": "2023 - 2023",
      "location": "Pittsburgh, PA",
      "skills": ["Spring Boot", "Angular", "Oracle SQL", "Spring Security", "JWT", "TDD"],
      "featured": true,
      "order": 2
    },
    {
      "id": "bnymellon",
      "company": "BNY Mellon",
      "position": "Software Engineer",
      "description": "I joined an early-stage application designed to manage flexible work arrangements amidst the uncertainty of post-COVID work policies. My primary role was to architect the application's core workflow engine. I built this configurable, graph-based engine to automate the entire request and approval chain for employees, replacing a manual process of paper and email. For my architectural contributions and the application's significant impact, I was honored to receive the 'New Grad of the Year' award.",
      "url": "https://www.bnymellon.com",
      "dates": "2021 - 2023",
      "location": "Pittsburgh, PA",
      "skills": ["Java", "Spring", "Oracle SQL", "Data Structures", "Algorithms"],
      "featured": true,
      "order": 3
    },
    {
      "id": "bnymellon-intern-2020",
      "company": "BNY Mellon",
      "position": "Software Engineer Intern",
      "description": "During my internship at BNY Mellon, I engineered a critical middleware API using Spring Boot to screen financial transactions. This service automatically flagged potential risks, including money laundering and fraud, by cross-referencing data with Fircosoft watchlists. I was fully integrated into the team's agile workflow, contributing through pair programming, Test-Driven Development (TDD), and writing technical documentation.",
      "url": "https://www.bnymellon.com",
      "dates": "2020",
      "location": "Pittsburgh, PA",
      "skills": ["Java", "Spring Boot", "TDD", "Pair Programming"],
      "featured": true,
      "order": 4
    },
    {
      "id": "bentley-intern-2019",
      "company": "Bentley Systems",
      "position": "Software Engineer Intern",
      "description": "As an intern on the ProjectWise Web team, I helped build a 'digital twin' collaboration platform used by over 2,500 companies. My key contributions included implementing user management features and designing a unique hash-based, color generation algorithm to enhance user identifiability on the platform.",
      "url": "https://www.bentley.com",
      "dates": "2019",
      "location": "Greater Pittsburgh Area",
      "skills": ["Typescript", "React", "Agile", "Scrum", "Front-end Development"],
      "featured": true,
      "order": 5
    }
  ],
  "metadata": {
    "title": "Work Experience"
  }
}